### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
players_number = len(purchase_data["SN"].unique())
players_number

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.
* Create a summary data frame to hold the results

In [3]:
summary_df = purchase_data.describe()
summary_df

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [4]:
#Optional: give the displayed data cleaner formatting
#Display the summary data frame
#summary_df["Purchase ID"]= summary_df["Purchase ID"].astype(int)
#summary_df
summary_df["Price"] = summary_df["Price"].map("${:,.2f}".format)
summary_df

       Purchase ID         Age     Item ID    Price
count   780.000000  780.000000  780.000000  $780.00
mean    389.500000   22.714103   91.755128    $3.05
std     225.310896    6.659444   52.697702    $1.17
min       0.000000    7.000000    0.000000    $1.00
25%     194.750000   20.000000   47.750000    $1.98
50%     389.500000   22.000000   92.000000    $3.15
75%     584.250000   25.000000  138.000000    $4.08
max     779.000000   45.000000  183.000000    $4.99

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [5]:
gender_count = purchase_data["Gender"].value_counts()
gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [6]:
total = gender_count[0]+gender_count[1]+gender_count[2]
female_percentage = round(gender_count[1]/total*100,2)
male_percentage = round(gender_count[0]/total*100,2)
other_percentage = round(gender_count[2]/total*100,2)
print(female_percentage)
print(male_percentage)
print(other_percentage)

14.49
83.59
1.92


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
grouped_purchase_gender = purchase_data.groupby(["Gender"])
grouped_count = grouped_purchase_gender.count()
grouped_count

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [8]:
total_purchase_value = grouped_purchase_gender["Price"].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [9]:
purchase_count = grouped_count["Purchase ID"]
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [10]:
average_purchase_price = round(total_purchase_value/purchase_count,2)
average_purchase_price

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
dtype: float64

In [11]:
person_name = grouped_purchase_gender["SN"].nunique()
person_name

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [12]:
average_purchase_person = total_purchase_value/person_name
average_purchase_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [13]:
summary_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Average Purchase Price": average_purchase_price.map("${:.2f}".format),
    "Total Purchase Value": total_purchase_value.map("${:.2f}".format),
    "Avg Total Purchase per Person": average_purchase_person.map("${:.2f}".format)
})
summary_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [14]:
bins = [0,9,14,19,24,29,34,39,99]
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
purchase_data["Age Group"] = pd.cut(purchase_data["Age"],bins,labels=group_names, include_lowest=True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [15]:
age_grouped_df = purchase_data.groupby(["Age Group"])
age_grouped_df.count().head()

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Group
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101

In [16]:
total_count = age_grouped_df["SN"].nunique()
total_count

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [17]:
total_players= total_count.sum()
percentage_players = (total_count/total_players*100).map("{:.2f}%".format)
percentage_players

Age Group
<10       2.95%
10-14     3.82%
15-19    18.58%
20-24    44.79%
25-29    13.37%
30-34     9.03%
35-39     5.38%
40+       2.08%
Name: SN, dtype: object

In [18]:
age_demographic_df = pd.DataFrame({
    "Total Count": total_count,
    "Percentage of Players": percentage_players
})
age_demographic_df

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
purchase_count = age_grouped_df["Purchase ID"].count()
purchase_count

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [20]:
total_purchase_value = age_grouped_df["Price"].sum()
total_purchase_value

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [21]:
average_purchase_price = (total_purchase_value/purchase_count)
average_purchase_price

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
dtype: float64

In [22]:
average_purchase_person_agedgroup = (total_purchase_value/total_count).map("${:.2f}".format)
average_purchase_person_agedgroup

Age Group
<10      $4.54
10-14    $3.76
15-19    $3.86
20-24    $4.32
25-29    $3.81
30-34    $4.12
35-39    $4.76
40+      $3.19
dtype: object

In [23]:
purchase_analysis_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Average Purchase Price": average_purchase_price,
    "Total Purchase Value": total_purchase_value,
    "Avg Total Purchase per Person": average_purchase_person_agedgroup
})
purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,$4.54
10-14,28,2.956429,82.78,$3.76
15-19,136,3.035956,412.89,$3.86
20-24,365,3.052219,1114.06,$4.32
25-29,101,2.900990,293.00,$3.81
30-34,73,2.931507,214.00,$4.12
35-39,41,3.601707,147.67,$4.76
40+,13,2.941538,38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [24]:
sn_grouped_df = purchase_data.groupby(["SN"])
sn_grouped_df.count().sort_values("Purchase ID", ascending=False).head()

             Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Group
SN
Lisosia93              5    5       5        5          5      5          5
Iral74                 4    4       4        4          4      4          4
Idastidru52            4    4       4        4          4      4          4
Asur53                 3    3       3        3          3      3          3
Inguron55              3    3       3        3          3      3          3

In [25]:
purchase_count_sn = sn_grouped_df["Purchase ID"].count()
purchase_count_sn[purchase_count_sn.index=="Lisosia93"]

SN
Lisosia93    5
Name: Purchase ID, dtype: int64

In [26]:
total_purchase_value = sn_grouped_df["Price"].sum()
total_purchase_value.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [27]:
average_purchase_price = (total_purchase_value/purchase_count_sn)
average_purchase_price.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
dtype: float64

In [28]:
sn_sum_df = pd.DataFrame({
    "Purchase Count":purchase_count_sn,
    "Average Purchase Price":average_purchase_price,
    "Total Purchase Value":total_purchase_value
}).sort_values("Total Purchase Value", ascending=False)
sn_sum_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [29]:
new_df = purchase_data[["Item ID","Item Name","Price"]]
new_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [34]:
new_df["Item ID"].nunique()

179

In [52]:
item_grouped = new_df.groupby(["Item ID","Item Name"])
purchase_count_item = item_grouped.count()

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [53]:
total_purchase_value_item = item_grouped["Price"].sum()
df = pd.DataFrame(total_purchase_value_item)
df["Purchase Count"] = purchase_count_item["Price"]
df

                                                      Price  Purchase Count
Item ID Item Name
0       Splinter                                       5.12               4
1       Crucifer                                      11.77               4
2       Verdict                                       14.88               6
3       Phantomlight                                  14.94               6
4       Bloodlord's Fetish                             8.50               5
...                                                     ...             ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76              12
179     Wolf, Promise of the Moonwalker               26.88               6
181     Reaper's Toll                                  8.30               5
182     Toothpick                                     12.09               3
183     Dragon's Greatsword                            3.27               3

[179 rows x 2 columns]

In [58]:
df["Item Price"]=df["Price"]/df["Purchase Count"]
df.sort_values("Price", ascending=False)

,,Price,Purchase Count,Item Price
Item ID,Item Name,,,
92,Final Critic,59.99,13,4.614615
178,"Oathbreaker, Last Hope of the Breaking Storm",50.76,12,4.230000
82,Nirvana,44.10,9,4.900000
145,Fiery Glass Crusader,41.22,9,4.580000
103,Singed Scalpel,34.80,8,4.350000
...,...,...,...,...
28,"Flux, Destroyer of Due Diligence",2.12,2,1.060000
125,Whistling Mithril Warblade,2.00,2,1.000000
126,Exiled Mithril Longsword,2.00,1,2.000000
104,Gladiator's Glaive,1.93,1,1.930000
42,The Decapitator,1.75,1,1.750000

In [59]:
popular_items_df = pd.DataFrame({
    "Purchase Count":purchase_count_item,
    "Item Price":item_price_item,
    "Total Purchase Value":total_purchase_value_item
})
popular_items_df[["Item Price","Total Purchase Value"]].astype(float).map("${:.2f}".format)
popular_items_df.head()

ValueError: Shape of passed values is (1, 3), indices imply (179, 3)

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame